xueliu/nRF51822/nRF51_SDK_8.0.0/examples/ble_peripheral/experimental_ble_app_ancs/ble_ancs_c.c
    if (p_notification->handle == m_service.notification_source.handle_value)
    {
        event.data.notification.event_id       = p_notification->data[0];                 /*lint -e{*} suppress Warning 415: possible access out of bond */
        event.data.notification.event_flags    = p_notification->data[1];                 /*lint -e{*} suppress Warning 415: possible access out of bond */
        event.data.notification.category_id    = p_notification->data[2];                 /*lint -e{*} suppress Warning 415: possible access out of bond */
        event.data.notification.category_count = p_notification->data[3];                 /*lint -e{*} suppress Warning 415: possible access out of bond */
        memcpy(event.data.notification.notification_uid, &p_notification->data[4], 4);    /*lint -e{*} suppress Warning 415: possible access out of bond */
        event.evt_type = BLE_ANCS_C_EVT_IOS_NOTIFICATION;

        p_ancs->evt_handler(&event);

        if (event.data.notification.event_id == BLE_ANCS_EVENT_ID_NOTIFICATION_ADDED)
        {
            ble_ancs_attr_list_t attr_list[2];
            attr_list[0].attribute_id = BLE_ANCS_NOTIFICATION_ATTRIBUTE_ID_TITLE;
            attr_list[0].attribute_len = 32;
            attr_list[1].attribute_id = BLE_ANCS_NOTIFICATION_ATTRIBUTE_ID_MESSAGE;
            attr_list[1].attribute_len = 32;
            uint32_t err_code = ble_ancs_get_notification_attributes(p_ancs, event.data.notification.notification_uid, 2, attr_list);
            APP_ERROR_CHECK(err_code);
            m_parse_state = COMMAND_ID;
        }
    }
    else if (p_notification->handle == m_service.data_source.handle_value)
    {
        parse_get_notification_attributes_response(p_ancs, p_notification->data, p_notification->len);    
    }
}

/**@brief Function for handling write response events.
 */
static void event_write_rsp(ble_ancs_c_t * p_ancs, const ble_evt_t * p_ble_evt)
{
    tx_buffer_process();
}

/**@brief Function for disconnecting and cleaning the current service.
 */
static void event_disconnect(ble_ancs_c_t * p_ancs)
{
    m_client_state = STATE_IDLE;

    if (m_service.handle == INVALID_SERVICE_HANDLE_DISC &&
        p_ancs->central_handle != DM_INVALID_ID)
    {
        m_service.handle = p_ancs->central_handle;
    }

    if (m_service.handle < BLE_ANCS_MAX_DISCOVERED_CENTRALS)
    {
        mp_service_db[m_service.handle] = m_service;
    }

    memset(&m_service, 0, sizeof(apple_service_t));

    m_service.handle       = INVALID_SERVICE_HANDLE;
    p_ancs->service_handle = INVALID_SERVICE_HANDLE;
    p_ancs->conn_handle    = BLE_CONN_HANDLE_INVALID;
    p_ancs->central_handle  = DM_INVALID_ID;
}


/**@brief Function for handling of Device Manager events.
 */
void ble_ancs_c_on_device_manager_evt(ble_ancs_c_t      * p_ans,
                                      dm_handle_t const * p_handle,
                                      dm_event_t const  * p_dm_evt)
{
    switch (p_dm_evt->event_id)
    {
        case DM_EVT_CONNECTION:
            // Fall through.
        case DM_EVT_SECURITY_SETUP_COMPLETE:
            p_ans->central_handle = p_handle->device_id;
            break;
        default:
            // Do nothing.
            break;
    }
}


/**@brief Function for handling of BLE stack events.
 */
void ble_ancs_c_on_ble_evt(ble_ancs_c_t * p_ancs, const ble_evt_t * p_ble_evt)
{
    uint16_t event = p_ble_evt->header.evt_id;

    switch (m_client_state)
    {
        case STATE_UNINITIALIZED:
            // Initialization is handle in special case, thus if we enter here, it means that an
            // event is received even though we are not initialized --> ignore.
            break;

        case STATE_IDLE:
            if (event == BLE_GAP_EVT_CONNECTED)
            {
                event_connect(p_ancs, p_ble_evt);
            }
            break;

        case STATE_WAITING_ENC:
            if ((event == BLE_GAP_EVT_AUTH_STATUS)|| (event == BLE_GAP_EVT_SEC_INFO_REQUEST))
            {
                event_encrypted_link(p_ancs, p_ble_evt);
            }
            else if (event == BLE_GAP_EVT_DISCONNECTED)
            {
                event_disconnect(p_ancs);
            }
            break;

        case STATE_DISC_SERV:
            if (event == BLE_GATTC_EVT_PRIM_SRVC_DISC_RSP)
            {
                event_discover_rsp(p_ancs, p_ble_evt);
            }
            else if (event == BLE_GAP_EVT_DISCONNECTED)
            {
                event_disconnect(p_ancs);
            }
            break;

        case STATE_DISC_CHAR:
            if (event == BLE_GATTC_EVT_CHAR_DISC_RSP)
            {
                event_characteristic_rsp(p_ancs, p_ble_evt);
            }
            else if (event == BLE_GAP_EVT_DISCONNECTED)
            {
                event_disconnect(p_ancs);
            }
            break;

        case STATE_DISC_DESC:
            if (event == BLE_GATTC_EVT_DESC_DISC_RSP)
            {
                event_descriptor_rsp(p_ancs, p_ble_evt);
            }
            else if (event == BLE_GAP_EVT_DISCONNECTED)
            {
                event_disconnect(p_ancs);
            }
            break;

        case STATE_RUNNING:
            if (event == BLE_GATTC_EVT_HVX)
            {
                event_notify(p_ancs, p_ble_evt);
            }
            else if (event == BLE_GATTC_EVT_WRITE_RSP)
            {
                event_write_rsp(p_ancs, p_ble_evt);
            }
            else if (event == BLE_GAP_EVT_DISCONNECTED)
            {
                event_disconnect(p_ancs);
            }
            else
            {
                // Do nothing, event not handled in this state.
            }
            break;

        case STATE_RUNNING_NOT_DISCOVERED:
        default:
            if (event == BLE_GAP_EVT_DISCONNECTED)
            {
                event_disconnect(p_ancs);
            }
            break;
    }
}


static void ancs_pstorage_callback(pstorage_handle_t * handle,
                                   uint8_t             op_code,
                                   uint32_t            reason,
                                   uint8_t           * p_data,
                                   uint32_t            param_len)
{
    if (reason != NRF_SUCCESS)
    {
        m_ancs_c_obj->error_handler(reason);
    }
}


uint32_t ble_ancs_c_init(ble_ancs_c_t * p_ancs, const ble_ancs_c_init_t * p_ancs_init)
{
    uint32_t                err_code;
    pstorage_module_param_t param;
    
